Revit 2027 API
Application.DocumentWorksharingEnabled Event
 Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<DocumentWorksharingEnabledEventArgs> DocumentWorksharingEnabled
Public Event DocumentWorksharingEnabled As EventHandler(Of DocumentWorksharingEnabledEventArgs)
public:
 event EventHandler<DocumentWorksharingEnabledEventArgs^>^ DocumentWorksharingEnabled {
	void add (EventHandler<DocumentWorksharingEnabledEventArgs^>^ value);
	void remove (EventHandler<DocumentWorksharingEnabledEventArgs^>^ value);
}
member DocumentWorksharingEnabled : IEvent<EventHandler<DocumentWorksharingEnabledEventArgs>,
    DocumentWorksharingEnabledEventArgs>
Value
EventHandler<DocumentWorksharingEnabledEventArgs>
Remarks
This event is raised when Revit has just enabled worksharing in the document.
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace